{
  "version": "1.0.0",
  "updated": "2025-05-26T00:30:00Z",
  "tags": [
    {
      "tag": "archive",
      "description": "Связано с архивированием project data, безопасностью данных и историей изменений.",
      "best_practices": "Использовать для всех задач и PR, связанных с переносом, сохранением или восстановлением данных."
    },
    {
      "tag": "workflow",
      "description": "Обозначает задачи, идеи, инсайты и PR, влияющие на процессы, автоматизацию и организацию работы.",
      "best_practices": "Использовать для всего, что меняет или описывает рабочие процессы, автоматизацию, правила взаимодействия."
    },
    {
      "tag": "llm_context",
      "description": "Используется для объектов, которые должны быть в фокусе LLM или участвуют в LLM-оркестрации.",
      "best_practices": "Добавлять к задачам, идеям, инсайтам, которые критичны для контекста LLM или требуют особого внимания при генерации/автоматизации."
    },
    {
      "tag": "tags",
      "description": "Связано с метками, фильтрацией, категоризацией и документацией по tags.",
      "best_practices": "Использовать для задач и идей по улучшению системы меток, фильтрации и документации."
    },
    {
      "tag": "lessons_learned",
      "description": "Фиксация выводов, ошибок, ретроспективы и улучшений по workflow.",
      "best_practices": "Добавлять к инсайтам и задачам, отражающим опыт и выводы для будущих улучшений."
    },
    {
      "tag": "automation",
      "description": "Автоматизация процессов, интеграция с CLI, API, Kanban и т.д.",
      "best_practices": "Использовать для всего, что связано с автоматизацией, скриптами, интеграциями."
    },
    {
      "tag": "prompts",
      "description": "Связано с разработкой, сбором и применением промтов для LLM и автоматизации.",
      "best_practices": "Добавлять к задачам и идеям по созданию, тестированию и внедрению промтов."
    },
    {
      "tag": "best_practices",
      "description": "Документирование и внедрение лучших практик по workflow, LLM, автоматизации.",
      "best_practices": "Использовать для задач, идей, инсайтов по формализации и распространению best practices."
    },
    {
      "tag": "status",
      "description": "Связано с хранением, отображением и автоматизацией статусов project data.",
      "best_practices": "Добавлять к задачам и идеям по рефакторингу или интеграции статусов."
    },
    {
      "tag": "documentation",
      "description": "Документирование процессов, структуры, best practices, справочников.",
      "best_practices": "Использовать для всего, что связано с документацией и обучением."
    }
  ]
} 